---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.CannotMakePointHostedByIntersection
source: html/5de153b3-db33-b573-a0a2-b9df5d648f73.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.CannotMakePointHostedByIntersection Property

Cannot make point hosted by intersection.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakePointHostedByIntersection { get; }
```